Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.HasSameType(Autodesk.Revit.DB.Electrical.PanelScheduleTemplate)
Checks if given template has the same panel schedule type with this template.
Remarks:
The panel schedule type is the enum type of PanelScheduleType class (Branch, switchboard, data etc.)
otherTemplate:
The given template to check.
Returns:
True if the given template has the same panel schedule type with this template, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.SetTableData(Autodesk.Revit.DB.Electrical.PanelScheduleData)
Assigns table data to this template
Data:
The panel schedule data
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.CopyFrom(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.PanelScheduleTemplate)
Copies all values from other element to this object.
OtherADoc:
The Document for the otherElem
otherElem:
The element being copied from.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given template otherElem has different type of this element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Electrical.PanelScheduleType,Autodesk.Revit.DB.Electrical.PanelConfiguration,System.String)
Creates a new instance of a panel schedule template.
Remarks:
If the given name has already been used by existing panel schedule templates,
a unique name will be used for the newly created template.
document:
The document where the element will be created and added.
type:
The panel schedule type.
config:
The panel configuration type.
strName:
The name of the panel schedule template to be created.
Returns:
The newly created panel schedule template element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The type is not valid for this element.
-or-
The config is not valid for panel schedule type type of this template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration